Repository: payment4-labs/wordpress_plugin
Catalog: languages/payment4-crypto-payment-gateway-*.po
Languages: fa_ir

source: Payment4 Crypto Payment gateway
fa_ir: درگاه پرداخت کریپتو پیمنت۴

source: Crypto Payment Gateway integration with WooCommerce, RCP, EDD, and Gravity Forms.
fa_ir: درگاه پرداخت کریپتو پیمنت۴ برای افزونه های WooCommerce, RCP, EDD و Gravity Forms

source: Payment4, Amirhossein Taghizadeh
fa_ir: پیمنت۴، امیرحسین تقی‌زاده

source: Settings
fa_ir: تنظیمات

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Save Modules
fa_ir: ذخیره ماژول‌ها

source: Payment4
fa_ir: پیمنت۴

source: General Settings
fa_ir: تنظیمات عمومی

source: Active Plugins
fa_ir: پلاگین‌های فعال

source: Plugins
fa_ir: پلاگین‌ها

source: API Key
fa_ir: کلید API

source: SandBox Mode
fa_ir: حالت سندباکس

source: SandBox
fa_ir: سندباکس

source: Select Active Plugins
fa_ir: پلاگین های فعال را انتخاب کنید

source: Settings saved successfully.
fa_ir: تنظیمات با موفقیت ذخیره شد.

source: Payment4 (Pay with Crypto)
fa_ir: پیمنت۴ ( پرداخت با کریپتو )

source: Payment4 payment gateway is not setup.
fa_ir: درگاه پیمنت۴ تنظیم یا فعال نیست.

source: Currency not supported by Payment4.
fa_ir: ارز توسط پیمنت۴ پشتیبانی نمی‌شود.

source: Payment creation failed.
fa_ir: پرداخت ایجاد نشد.

source: Payment successful. Payment UID: %1$s, Status: %2$s, Amount Difference: %3$s
fa_ir: پرداخت با موفقیت انجام شد. شناسه پرداخت: %1$s، وضعیت: %2$s، اختلاف مبلغ: %3$s

source: Payment failed. Payment UID: %1$s, Status: %2$s, Amount Difference: %3$s, Error: %4$s
fa_ir: پرداخت ناموفق بود. شناسه پرداخت: %1$s، وضعیت: %2$s، اختلاف مبلغ: %3$s، خطا: %4$s

source: Iranian Toman (IRT)
fa_ir: تومان ایران (IRT)

source: To change Payment4 options (such as API key & Sandbox mode) visit
fa_ir: برای تغییر تنظیمات پیمنت۴ به صفحه تنظیمات مراجعه کنید:

source: Payment4 Settings
fa_ir: تنظیمات پیمنت۴

source: paymentUid or formId missing
fa_ir: شناسه پرداخت یا شناسه فرم وجود ندارد

source: Entry missing
fa_ir: ورودی وجود ندارد

source: Payment4 API Key is missing.
fa_ir: کلید API پیمنت۴ پیدا نشد.

source: The selected currency is not supported by Payment4.
fa_ir: ارز مورد نظر توسط پیمنت۴ پشتیبانی نمیشود.

source: Payment record not found.
fa_ir: رکورد پرداخت پیدا نشد.

source: Membership #%s
fa_ir: عضویت شماره‌ی #%s

source: Payment created. Payment UID: %1$s, Payment URL: %2$s
fa_ir: پرداخت ایجاد شد. شناسه پرداخت: %1$s, لینک پرداخت: %2$s

source: Unable to redirect to Payment4 payment page.
fa_ir: امکان هدایت به صفحه پرداخت پیمنت۴ وجود ندارد.

source: <strong> Acceptable </strong> payment for membership "%1$s"; Payment ID: #%2$d; Amount: %3$s; Gateway: %4$s; Type: %5$s; Amount Difference: %6$s
fa_ir: پرداخت <strong> قابل قبول </strong> برای عضویت "%1$s"; شناسه پرداخت: #%2$d; مبلغ: %3$s; درگاه: %4$s; نوع: %5$s; اختلاف مبلغ: %6$s

source: Payment <strong> %1$s </strong>; Payment ID: %2$s; Amount Difference: %3$s
fa_ir: پرداخت <strong> %1$s </strong>; شناسه پرداخت: %2$s; اختلاف مبلغ: %3$s

source: Payment %1$s. <br> Payment UID: %2$s <br> Status: %3$s <br> Amount Difference: %4$s
fa_ir: پرداخت %1$s. <br> شناسه پرداخت: %2$s <br> وضعیت: %3$s <br> اختلاف مبلغ: %4$s

source: <strong> Mismatch </strong> payment for membership "%1$s"; Payment ID: #%2$d; Amount: %3$s; Gateway: %4$s; Type: %5$s; Amount Difference: %6$s
fa_ir: پرداخت <strong> میس‌مچ </strong> برای عضویت "%1$s"; شناسه پرداخت: #%2$d; مبلغ: %3$s; درگاه: %4$s; نوع: %5$s; اختلاف مبلغ: %6$s

source: Payment <strong> %1$s </strong>; Payment ID: %2$s; Amount Difference: %3$s; Error: %4$s
fa_ir: پرداخت <strong> %1$s </strong>; شناسه پرداخت: %2$s; اختلاف مبلغ: %3$s; خطا: %4$s

source: Payment %1$s. <br> Payment UID: %2$s <br> Status: %3$s <br> Amount Difference: %4$s <br> Error: %5$s
fa_ir: پرداخت %1$s. <br> شناسه پرداخت: %2$s <br> وضعیت: %3$s <br> اختلاف مبلغ: %4$s <br> خطا: %5$s

source: Payment acceptable.
fa_ir: پرداخت قابل قبول.

source: Payment successful.
fa_ir: پرداخت موفق.

source: Payment mismatched.
fa_ir: پرداخت میس مچ.

source: Payment failed.
fa_ir: پرداخت ناموفق.

source: Payment ID not found
fa_ir: شناسه پرداخت پیدا نشد.

source: Callback or Webhook URL must be a valid URL in production mode.
fa_ir: لینک کال‌بک یا وب‌هوک در حالت پروداکشن باید یک URL معتبر باشد.

source: API key not provided.
fa_ir: کلید API ارائه نشده است.

source: API key not found.
fa_ir: کلید API پیدا نشد.

source: Gateway not approved.
fa_ir: درگاه پرداخت مورد قبول نیست.

source: Payment not found.
fa_ir: پرداخت پیدا نشد.

source: Invalid amount.
fa_ir: مبلغ نامعتبر.

source: Invalid currency.
fa_ir: ارز نامعتبر.

source: Assets not found.
fa_ir: دارایی‌ها پیدا نشدند.

source: Payment amount lower than minimum.
fa_ir: مبلغ پرداخت کمتر از مجاز است.

source: Invalid language.
fa_ir: زبان نامعتبر.

source: An error occurred during payment.
fa_ir: خطایی هنگام پرداخت رخ داده است.

source: Gateway settings for WooCommerce
fa_ir: تنظیمات درگاه برای ووکامرس

source: ( Pay with Crypto )
fa_ir: ( پرداخت با کریپتو )

source: Get %s Percent Discount for paying by Payment4
fa_ir: دریافت %s درصد تخفیف درصورت پرداخت با پیمنت۴

source: ⛔ Your order was not completed due to a payment mismatch.<br/>Please contact support.
fa_ir: ⛔ سفارش شما به دلیل مغایرت در مبلغ نهایی ثبت نشد.<br/>لطفاً با پشتیبانی تماس بگیرید

source: ⚠ Your order was received, but the payment amount was not exact.<br/>Please wait while we review it.
fa_ir: ⚠ سفارش شما ثبت شد، اما مبلغ پرداختی با مبلغ مورد انتظار متفاوت بود.<br/>لطفاً منتظر بررسی باشید.

source: Payment4 Crypto Discount (%s%%)
fa_ir: تخفیف پیمنت۴ (%s%%)

source: Enable/Disable
fa_ir: فعال/غیرفعال

source: Activation of the payment gateway
fa_ir: فعالسازی درگاه پرداخت

source: Tick the checkbox to activate
fa_ir: جهت فعالسازی کلیک کنید

source: Managed in Payment4 General Settings
fa_ir: قابل تنظیم در تنظیمات عمومی پیمنت۴

source: Sandbox Mode
fa_ir: حالت سندباکس

source: Enable/Disable Sandbox mode
fa_ir: فعال/غیرفعال حالت سندباکس

source: Title
fa_ir: عنوان

source: Gateway title
fa_ir: عنوان درگاه

source: Description
fa_ir: توضیحات

source: Gateway description
fa_ir: توضیحات درگاه

source: Accepting Crypto Payments
fa_ir: پرداخت با کریپتو

source: Discount Percent
fa_ir: درصد تخفیف

source: Set 0 for no Discount
fa_ir: برای پاک کردن تخفیف 0 قرار دهید

source: Success payment message
fa_ir: پیام پرداخت موفق

source: Successful payment.
fa_ir: پرداخت موفق

source: Failed payment message
fa_ir: پیام پرداخت ناموفق

source: Transaction Failed.
fa_ir: تراکنش ناموفق

source: Acceptable payment message
fa_ir: پیام پرداخت Acceptable

source: Payment accepted.
fa_ir: پرداخت قابل قبول

source: Mismatched payment message
fa_ir: پیام پرداخت mismatch

source: Payment Mismatched.
fa_ir: پرداخت غیرقابل قبول

source: Back
fa_ir: برگشت

source: The selected currency is not supported
fa_ir: ارز انتخابی پشتیبانی نمیشود.

source: Order number not found.
fa_ir: شماره سفارش پیدا نشد.

source: The status of the transaction has already been determined.
fa_ir: وضعیت تراکنش قبلا مشخص شده است.

source: Handling payment4 status "%s" failed.
fa_ir: خطا در پردازش وضعیت پیمنت۴ "%s".

source: Payment successfull.
fa_ir: پرداخت موفق.

source: callbackUrl must be a URL address in production mode
fa_ir: لینک کالبک باید یک آدرس معتبر در حالت پروداکشن باشد.

source: api key not send
fa_ir: کلید API ارسال نشده است.

source: api key not found
fa_ir: کلید API پیدا نشد.

source: gateway not approved
fa_ir: درگاه مورد تایید نیست.

source: payment not found
fa_ir: پرداخت پیدا نشد.

source: invalid amount
fa_ir: مبلغ نامعتبر است.

source: invalid currency
fa_ir: ارز نامعتبر است.

source: assets not found
fa_ir: دارایی ها پیدا نشدند.

source: payment amount lower than minimum
fa_ir: مبلغ پرداخت کمتر از حداقل است.

source: invalid language
fa_ir: زبان نامعتبر.

# Order status
source: Payment4 Acceptable
fa_ir: پیمنت۴ قابل قبول

# Order status
source: Payment4 Acceptable <span class="count">(%1$s)</span>
fa_ir: پیمنت۴ قابل قبول <span class="count">(%1$s)</span>

# Order status
source: Payment4 Mismatch
fa_ir: پیمنت۴ میس‌مچ

# Order status
source: Payment4 Mismatch <span class="count">(%1$s)</span>
fa_ir: پیمنت۴ میس‌مچ <span class="count">(%1$s)</span>
